###
 # @Author: lwj
 # @Date: 2022-04-21 21:24:26
 # @Description: 传递参数
### 

# 在执行脚本命令时，可以传入参数，相当于c中的scanf功能
#$n.n代表一个数字，1为脚本中的第一个参数，其它数字以此类推
#$0代表脚本的文件名（包含文件路径）

#!/bin/bash
:<<EOF
ehco "Shell 参数传递实例"
echo "文件名为：$0"
echo "第一个参数：$1"
echo "第二个参数：$2"
echo "第三个参数：$3"
echo " "

# $#---传入脚本的参数的个数
# $*---以字符串输出所有参数,
# $$---显示当前进程id
# $!---后代运行的最后一个进程id
# $@---跟$*差不多,当他们单个被“”括起来的时候，$*输出的字符不换行,$@会换
# $?---显示命令最后退出的状态，返回0，则无错误

# $#、$*和$@使用示例
echo "参数个数：$#"
echo "以字符串形式输出所有参数：$*"
echo "以字符串形式输出所有参数：$@"

EOF

# $*和$@的区别
echo '$*和$@的区别'
echo "---\$*---"
for i in "$*"; do
    echo $i
done
echo "---\$@---"
for i in "$@"; do
    echo $i
done

